# StructuralConnectionOverrideType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralConnectionOverrideType Property
ParameterTypeId Class See Also
---
"Override by Instance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralConnectionOverrideType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionOverrideType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralConnectionOverrideType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace